###############################################################################
# Created by write_sdc
###############################################################################
current_design project_macro
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_uncertainty 0.1500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 3.0000 [get_clocks {clk}]
set_clock_latency -source -max 4.5000 [get_clocks {clk}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[10]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[10]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[11]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[11]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[12]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[12]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[13]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[13]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[14]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[14]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[3]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[3]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[4]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[4]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[5]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[5]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[6]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[6]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[7]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[7]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[8]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[8]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_in[9]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_in[9]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_in[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_in[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_in[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_in[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_in[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_in[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_in[3]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_in[3]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_in[4]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_in[4]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_in[5]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_in[5]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_in[6]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_in[6]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_in[7]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_in[7]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_in[8]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_in[8]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[0]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[0]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[10]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[10]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[11]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[11]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[12]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[12]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[13]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[13]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[1]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[1]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[2]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[2]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[3]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[3]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[4]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[4]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[5]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[5]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[6]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[6]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[7]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[7]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[8]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[8]}]
set_input_delay 1.2600 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_in[9]}]
set_input_delay 4.5500 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_in[9]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -add_delay [get_ports {por_n}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -add_delay [get_ports {reset_n}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[0]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[10]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[11]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[12]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[13]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[13]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[14]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[14]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[15]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[15]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[16]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[16]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[17]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[17]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[18]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[18]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[19]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[19]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[1]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[20]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[20]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[21]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[21]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[22]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[22]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[23]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[23]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[24]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[24]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[25]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[25]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[26]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[26]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[27]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[27]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[28]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[28]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[29]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[29]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[2]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[30]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[30]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[31]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[31]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[32]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[32]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[33]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[33]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[34]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[34]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[35]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[35]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[36]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[36]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[37]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[37]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[38]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[38]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[39]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[39]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[3]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[40]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[40]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[41]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[41]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[42]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[42]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[43]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[43]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[44]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[44]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[4]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[5]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[6]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[7]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[8]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_dm[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_dm[9]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[0]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[0]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[10]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[10]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[11]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[11]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[12]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[12]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[13]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[13]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[14]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[14]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[1]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[1]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[2]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[2]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[3]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[3]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[4]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[4]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[5]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[5]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[6]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[6]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[7]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[7]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[8]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[8]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_oeb[9]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_oeb[9]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[0]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[10]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[11]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[12]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[13]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[13]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[14]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[14]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[1]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[2]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[3]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[4]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[5]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[6]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[7]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[8]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_bot_out[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_bot_out[9]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[0]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[10]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[11]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[12]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[13]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[13]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[14]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[14]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[15]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[15]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[16]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[16]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[17]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[17]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[18]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[18]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[19]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[19]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[1]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[20]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[20]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[21]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[21]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[22]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[22]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[23]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[23]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[24]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[24]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[25]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[25]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[26]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[26]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[2]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[3]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[4]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[5]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[6]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[7]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[8]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_dm[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_dm[9]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_oeb[0]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_oeb[0]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_oeb[1]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_oeb[1]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_oeb[2]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_oeb[2]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_oeb[3]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_oeb[3]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_oeb[4]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_oeb[4]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_oeb[5]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_oeb[5]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_oeb[6]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_oeb[6]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_oeb[7]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_oeb[7]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_oeb[8]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_oeb[8]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_out[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_out[0]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_out[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_out[1]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_out[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_out[2]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_out[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_out[3]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_out[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_out[4]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_out[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_out[5]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_out[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_out[6]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_out[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_out[7]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_rt_out[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_rt_out[8]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[0]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[10]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[11]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[12]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[13]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[13]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[14]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[14]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[15]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[15]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[16]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[16]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[17]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[17]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[18]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[18]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[19]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[19]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[1]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[20]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[20]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[21]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[21]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[22]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[22]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[23]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[23]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[24]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[24]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[25]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[25]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[26]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[26]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[27]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[27]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[28]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[28]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[29]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[29]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[2]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[30]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[30]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[31]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[31]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[32]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[32]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[33]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[33]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[34]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[34]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[35]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[35]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[36]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[36]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[37]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[37]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[38]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[38]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[39]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[39]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[3]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[40]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[40]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[41]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[41]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[4]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[5]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[6]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[7]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[8]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_dm[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_dm[9]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[0]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[0]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[10]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[10]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[11]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[11]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[12]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[12]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[13]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[13]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[1]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[1]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[2]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[2]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[3]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[3]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[4]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[4]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[5]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[5]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[6]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[6]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[7]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[7]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[8]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[8]}]
set_output_delay 2.3400 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_oeb[9]}]
set_output_delay 9.3200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_oeb[9]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[0]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[0]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[10]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[10]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[11]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[11]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[12]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[12]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[13]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[13]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[1]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[1]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[2]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[2]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[3]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[3]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[4]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[4]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[5]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[5]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[6]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[6]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[7]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[7]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[8]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[8]}]
set_output_delay 3.9000 -clock [get_clocks {clk}] -min -add_delay [get_ports {gpio_top_out[9]}]
set_output_delay 9.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {gpio_top_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[44]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[43]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[42]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[41]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[40]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[39]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[38]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[37]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[36]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[35]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[34]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[33]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[32]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[31]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[30]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[29]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[28]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[27]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[26]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[25]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[24]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[23]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[22]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[21]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[20]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[19]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[18]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[17]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[16]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[15]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[14]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[13]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[12]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[11]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[10]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[9]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_dm[0]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[14]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[13]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[12]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[11]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[10]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[9]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[14]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[13]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[12]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[11]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[10]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[9]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_bot_out[0]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[26]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[25]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[24]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[23]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[22]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[21]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[20]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[19]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[18]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[17]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[16]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[15]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[14]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[13]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[12]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[11]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[10]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[9]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_dm[0]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_oeb[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_oeb[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_oeb[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_oeb[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_oeb[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_out[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_out[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_out[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_out[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_out[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_out[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_out[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_out[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_rt_out[0]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[41]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[40]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[39]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[38]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[37]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[36]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[35]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[34]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[33]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[32]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[31]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[30]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[29]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[28]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[27]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[26]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[25]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[24]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[23]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[22]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[21]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[20]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[19]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[18]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[17]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[16]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[15]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[14]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[13]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[12]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[11]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[10]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[9]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_dm[0]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[13]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[12]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[11]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[10]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[9]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[13]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[12]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[11]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[10]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[9]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_top_out[0]}]
set_input_transition 0.8000 [get_ports {clk}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[14]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[14]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[13]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[13]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[12]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[12]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[11]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[11]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[10]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[10]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[9]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[9]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[8]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[8]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[7]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[7]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[6]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[6]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[5]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[5]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[4]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[4]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[3]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[3]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[2]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[2]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[1]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[1]}]
set_input_transition -min 0.0500 [get_ports {gpio_bot_in[0]}]
set_input_transition -max 0.3800 [get_ports {gpio_bot_in[0]}]
set_input_transition -min 0.0500 [get_ports {gpio_rt_in[8]}]
set_input_transition -max 0.3800 [get_ports {gpio_rt_in[8]}]
set_input_transition -min 0.0500 [get_ports {gpio_rt_in[7]}]
set_input_transition -max 0.3800 [get_ports {gpio_rt_in[7]}]
set_input_transition -min 0.0500 [get_ports {gpio_rt_in[6]}]
set_input_transition -max 0.3800 [get_ports {gpio_rt_in[6]}]
set_input_transition -min 0.0500 [get_ports {gpio_rt_in[5]}]
set_input_transition -max 0.3800 [get_ports {gpio_rt_in[5]}]
set_input_transition -min 0.0500 [get_ports {gpio_rt_in[4]}]
set_input_transition -max 0.3800 [get_ports {gpio_rt_in[4]}]
set_input_transition -min 0.0500 [get_ports {gpio_rt_in[3]}]
set_input_transition -max 0.3800 [get_ports {gpio_rt_in[3]}]
set_input_transition -min 0.0500 [get_ports {gpio_rt_in[2]}]
set_input_transition -max 0.3800 [get_ports {gpio_rt_in[2]}]
set_input_transition -min 0.0500 [get_ports {gpio_rt_in[1]}]
set_input_transition -max 0.3800 [get_ports {gpio_rt_in[1]}]
set_input_transition -min 0.0500 [get_ports {gpio_rt_in[0]}]
set_input_transition -max 0.3800 [get_ports {gpio_rt_in[0]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[13]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[13]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[12]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[12]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[11]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[11]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[10]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[10]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[9]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[9]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[8]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[8]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[7]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[7]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[6]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[6]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[5]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[5]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[4]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[4]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[3]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[3]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[2]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[2]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[1]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[1]}]
set_input_transition -min 0.0500 [get_ports {gpio_top_in[0]}]
set_input_transition -max 0.3800 [get_ports {gpio_top_in[0]}]
set_timing_derate -early 0.9300
set_timing_derate -late 1.0700
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 16.0000 [current_design]
